Tekla Open API Reference for Tekla Structures 2025
Angle.ToString Method (String, IFormatProvider, Angle.UnitType)
 Converts the represented angle to a string with the given parameters
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ToString(
	string format,
	IFormatProvider formatProvider,
	Angle.UnitType angleUnit
)
Public Function ToString (
	format As String,
	formatProvider As IFormatProvider,
	angleUnit As Angle.UnitType
) As String
Parameters
format
Type: System.String
The format string. Can be null.
formatProvider
Type: System.IFormatProvider
The number format provider.
angleUnit
Type: Tekla.Structures.Datatype.Angle.UnitType
The unit type.
Return Value
Type: String
This angle as a string
See Also
Reference
Angle Class
ToString Overload
Tekla.Structures.Datatype Namespace